project.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Comp 199 : Group 07 Project</title>
<!-- 2014-04-23 Wed 13:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jared Smith, Sam Beveridge, Calvin Lam" />
<link rel="stylesheet" type="text/css" href="css/project-style.css" />
<link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro' rel='stylesheet' type='text/css'/>
</head>
<body>
<div id="content">
<h1 class="title">Comp 199 : Group 07 Project</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Team Members</a></li>
<li><a href="#sec-2">Week 1</a>
<ul>
<li><a href="#sec-2-1">Review  |  Gantt Chart</a></li>
<li><a href="#sec-2-2"><span class="done DONE">DONE</span> : <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-04-08 Tue&gt;</span></span> Google+ Connect</a></li>
<li><a href="#sec-2-3"><span class="done DONE">DONE</span> : <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-04-17 Thu&gt;</span></span> Create Gantt Chart</a></li>
<li><a href="#sec-2-4"><span class="done DONE">DONE</span> : <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-04-17 Thu&gt;</span></span> Week Review</a></li>
</ul>
</li>
<li><a href="#sec-3">Week 2</a>
<ul>
<li><a href="#sec-3-1"><span class="todo TODO">TODO</span> : Create Database tables</a></li>
<li><a href="#sec-3-2"><span class="todo TODO">TODO</span> : Insert sample data</a></li>
<li><a href="#sec-3-3"><span class="todo TODO">TODO</span> : Access sample data to display</a></li>
<li><a href="#sec-3-4"><span class="todo TODO">TODO</span> : Home page design</a></li>
<li><a href="#sec-3-5"><span class="todo TODO">TODO</span> : Week Review</a></li>
<li><a href="#sec-3-6"><span class="todo TODO">TODO</span> : Gantt Chart</a></li>
</ul>
</li>
<li><a href="#sec-4">Week 3</a>
<ul>
<li><a href="#sec-4-1"><span class="todo TODO">TODO</span> : Project Structure (directories)</a></li>
</ul>
</li>
<li><a href="#sec-5">Week 4</a>
<ul>
<li><a href="#sec-5-1"><span class="todo TODO">TODO</span> : Add item(s) to shopping cart</a></li>
</ul>
</li>
<li><a href="#sec-6">Week 5</a>
<ul>
<li><a href="#sec-6-1"><span class="todo TODO">TODO</span> : Show shopping cart</a></li>
<li><a href="#sec-6-2"><span class="todo TODO">TODO</span> : Modify shopping cart</a></li>
</ul>
</li>
<li><a href="#sec-7">Week 6</a>
<ul>
<li><a href="#sec-7-1"><span class="todo TODO">TODO</span> : Form page</a></li>
<li><a href="#sec-7-2"><span class="todo TODO">TODO</span> : Billing and Shipping</a></li>
</ul>
</li>
<li><a href="#sec-8">Week 7</a>
<ul>
<li><a href="#sec-8-1"><span class="todo TODO">TODO</span> : Disable shipping info</a></li>
</ul>
</li>
<li><a href="#sec-9">Week 8</a>
<ul>
<li><a href="#sec-9-1"><span class="todo TODO">TODO</span> : Paypal api, payment system</a></li>
</ul>
</li>
<li><a href="#sec-10">Week 9</a>
<ul>
<li><a href="#sec-10-1"><span class="todo TODO">TODO</span> : Order confirmation and receipt</a></li>
</ul>
</li>
<li><a href="#sec-11">Week 10</a>
<ul>
<li><a href="#sec-11-1"><span class="todo TODO">TODO</span> : Final cleanup</a></li>
<li><a href="#sec-11-2"><span class="todo TODO">TODO</span> : Extra features</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Team Members</h2>
<div class="outline-text-2" id="text-1">
<p class="verse">
Sam Beveridge<br  />
Calvin Lam<br  />
Jared Smith<br  />
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Week 1</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><a href="./week1/week1.html">Review</a>  |  <a href="./week1/Week1ganttchart.pod">Gantt Chart</a></h3>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="done DONE">DONE</span> : <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-04-08 Tue&gt;</span></span> Google+ Connect</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Jared, Calvin, Sam
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="done DONE">DONE</span> : <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-04-17 Thu&gt;</span></span> Create Gantt Chart</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Jared
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="done DONE">DONE</span> : <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-04-17 Thu&gt;</span></span> Week Review</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Jared
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Week 2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="todo TODO">TODO</span> : Create Database tables</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Jared
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="todo TODO">TODO</span> : Insert sample data</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Sam
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="todo TODO">TODO</span> : Access sample data to display</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="todo TODO">TODO</span> : Home page design</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Calvin
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="todo TODO">TODO</span> : Week Review</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="todo TODO">TODO</span> : Gantt Chart</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Week 3</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="todo TODO">TODO</span> : Project Structure (directories)</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Week 4</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="todo TODO">TODO</span> : Add item(s) to shopping cart</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Week 5</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="todo TODO">TODO</span> : Show shopping cart</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="todo TODO">TODO</span> : Modify shopping cart</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Week 6</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="todo TODO">TODO</span> : Form page</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="todo TODO">TODO</span> : Billing and Shipping</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Week 7</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="todo TODO">TODO</span> : Disable shipping info</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Week 8</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="todo TODO">TODO</span> : Paypal api, payment system</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Week 9</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="todo TODO">TODO</span> : Order confirmation and receipt</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Week 10</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="todo TODO">TODO</span> : Final cleanup</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="todo TODO">TODO</span> : Extra features</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jared Smith, Sam Beveridge, Calvin Lam</p>
<p class="date">Created: 2014-04-23 Wed 13:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
